#!/usr/bin/env bash
set -e

if [ ! -f ".env" ]; then
  echo ".env not found"
  exit 1
fi

export $(grep -v '^#' .env | xargs)
if [ -z "$DATABASE_URL" ]; then
  echo "Error: DATABASE_URL not found in .env"
  exit 1
fi


docker compose exec -T db psql -U "$DB_USER" -d "$DB_NAME" <<'SQL'
DO $$
BEGIN
    IF EXISTS (SELECT 1 FROM buildings LIMIT 1) THEN
        RAISE NOTICE 'Db already contains data';
        RETURN;
    END IF;
END $$;

INSERT INTO buildings (address, latitude, longitude, location) VALUES
('ООО «Яндекс», г. Москва, ул. Льва Толстого, д. 16, 119021', 55.733771, 37.587937, ST_SetSRID(ST_MakePoint(37.587937, 55.733771), 4326)::geography),
('ПАО «Сбербанк», г. Москва, ул. Вавилова, д. 19, 117312', 55.712345, 37.605789, ST_SetSRID(ST_MakePoint(37.605789, 55.712345), 4326)::geography),
('ПАО «ВТБ», г. Санкт-Петербург, пер. Дегтярный, д. 11, лит. А, 191144', 59.945933, 30.360098, ST_SetSRID(ST_MakePoint(30.360098, 59.945933), 4326)::geography),
('ПАО «ЛУКОЙЛ», г. Москва, Сретенский бульвар, д. 11, 101000', 55.765432, 37.633210, ST_SetSRID(ST_MakePoint(37.633210, 55.765432), 4326)::geography),
('ПАО «Газпром», г. Москва, ул. Наметкина, д. 16, 117420', 55.660498, 37.540312, ST_SetSRID(ST_MakePoint(37.540312, 55.660498), 4326)::geography),
('ПАО «Ростелеком», г. Москва, ул. Долгоруковская, д. 15, 127006', 55.776543, 37.597890, ST_SetSRID(ST_MakePoint(37.597890, 55.776543), 4326)::geography),
('ПАО «Аэрофлот», г. Москва, Арбат, д. 10, 119002', 55.751244, 37.596123, ST_SetSRID(ST_MakePoint(37.596123, 55.751244), 4326)::geography),
('ПАО «Северсталь», г. Череповец, пл. Комсомольская, д. 11, 162608', 59.128456, 37.908234, ST_SetSRID(ST_MakePoint(37.908234, 59.128456), 4326)::geography),
('ПАО «Магнит», г. Москва, ул. Академика Королёва, д. 13, 129515', 55.823456, 37.614567, ST_SetSRID(ST_MakePoint(37.614567, 55.823456), 4326)::geography),
('ПАО «Mail.ru Group (VK)», г. Москва, Ленинградский проспект, д. 39, стр. 79, 125167', 55.807890, 37.510123, ST_SetSRID(ST_MakePoint(37.510123, 55.807890), 4326)::geography);

INSERT INTO activities (id, name, level, parent_id) VALUES
(1, 'ИТ и Интернет', 1, NULL),
(2, 'Банковская сфера', 1, NULL),
(3, 'Нефтегаз', 1, NULL),
(4, 'Промышленность', 1, NULL),
(5, 'Авиаперевозки', 1, NULL),
(6, 'Связь и телеком', 1, NULL),
(7, 'Розничная торговля', 1, NULL),
(8, 'Консалтинг', 1, NULL),
(9, 'Продукты питания', 1, NULL),
(10, 'Металлургия', 1, NULL),
(11, 'Мясная продукция', 2, 9),
(12, 'Молочная продукция', 2, 9),
(13, 'Сыры', 3, 12),
(14, 'Фермерские продукты', 3, 12),
(15, 'Грузовые авиаперевозки', 2, 5),
(16, 'Пассажирские авиаперевозки', 2, 5),
(17, 'Онлайн-торговля', 2, 7),
(18, 'Маркетплейс', 3, 17);

INSERT INTO organizations (id, name, building_id) VALUES
(1, 'ООО «Яндекс»', 1),
(2, 'ПАО «Сбербанк»', 2),
(3, 'ПАО «ВТБ»', 3),
(4, 'ПАО «ЛУКОЙЛ»', 4),
(5, 'ПАО «Газпром»', 5),
(6, 'ПАО «Ростелеком»', 6),
(7, 'ПАО «Аэрофлот»', 7),
(8, 'ПАО «Северсталь»', 8),
(9, 'ПАО «Магнит»', 9),
(10, 'ПАО «VK» (Mail.ru Group)', 10);

INSERT INTO organization_activities (organization_id, activity_id) VALUES
(1, 1),
(1, 17),
(2, 2),
(3, 2),
(4, 3),
(5, 3),
(6, 6),
(7, 5),
(7, 15),
(7, 16),
(8, 4),
(8, 10),
(9, 7),
(9, 11),
(9, 12),
(9, 13),
(9, 14),
(10, 1),
(10, 18);

INSERT INTO phones (number, organization_id) VALUES
('8-495-111-11-11', 1),
('8-495-222-22-22', 2),
('8-812-333-33-33', 3),
('8-495-444-44-44', 4),
('8-495-555-55-55', 5),
('8-495-666-66-66', 6),
('8-495-777-77-77', 7),
('8-820-888-88-88', 8),
('8-495-999-99-99', 9),
('8-495-101-01-01', 10);

SQL
